Revit 2026 API

# ScheduleFieldMultipleValuesDisplayType Property

---

Determines the type of multiple value indication to be used when the schedule field displays multiple element values.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ScheduleFieldMultipleValuesDisplayType MultipleValuesDisplayType { get; set; }
```
```vb
Public Property MultipleValuesDisplayType As ScheduleFieldMultipleValuesDisplayType
	Get
	Set
```
```cpp
public:
property ScheduleFieldMultipleValuesDisplayType MultipleValuesDisplayType {
	ScheduleFieldMultipleValuesDisplayType get ();
	void set (ScheduleFieldMultipleValuesDisplayType value);
}
```
```fsharp
member MultipleValuesDisplayType : ScheduleFieldMultipleValuesDisplayType with get, set
```

#### Property Value

ScheduleFieldMultipleValuesDisplayType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The default display type is Project, indicating that the project [!:Autodesk::Revit::DB::MultipleValuesIndicationSettings::Value] setting will be used.

#### Reference

ScheduleField Class

Autodesk.Revit.DB Namespace